Revit 2024 API
FailureMessageAccessor.GetCurrentResolutionType Method
 Retrieves the type of resolution to be used to resolve the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureResolutionType GetCurrentResolutionType()
Visual Basic
Public Function GetCurrentResolutionType As FailureResolutionType
Visual C++
public:
FailureResolutionType GetCurrentResolutionType()
Return Value
 The type of failure resolution to be used to resolve the failure.
Remarks
 If the current resolution type was never set for the failure, FailureResolutionType::Default is returned.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailureMessageAccessor has not been properly initialized. -or- This FailureMessageAccessor does not have any resolutions.
See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace